app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 6]]
---
        <div class="card-body">
          <% @post.comments.each do |comment| %>