app/controllers/comments_controller.rb

INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @comment = @post.comments.build(comment_params)
    @comment.user = current_user

    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 11], ["id", 6], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 6]]
---
  def destroy
    # @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
    ap @comment.id
    @comment.destroy