app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."status" = ?  [["status", "published"]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."status" = ?  [["status", "published"]]
---
  def index
    @posts = Post.where(status: 'published').paginate(page: params[:page], per_page: 8)

INSERT INTO "posts" ("title", "author", "content", "status", "creation_date", "published_date", "user_id", "image", "video", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save

UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "Cricket , My  Love . "], ["updated_at", "2024-07-12 18:38:05.296555"], ["id", 12]]
---
  def update
    if @post.update(post_params)